#!/usr/bin/python
# -*- coding: utf-8  -*-
# Z    (User:ZxxZxxZ) Base of the code + Word Dictionaries and some of Regexs
# Reza (User:Reza1615) Code structure + Developing the code
# Amir (User:Ladgroups) Category sorting part
# Ebraminio (User:Ebraminio) Some of Regexs
# Python 3
# Distributed under the terms of the CC-BY-SA 3.0 .
# for calling this bot you can use  fa_cosmetic_changes(text,page) function

if sys.version_info[0] > 2:
    from html.parser import HTMLParser
    basestring = (str,)
    unicode = str
else:
    from HTMLParser import HTMLParser
import pywikibot
from pywikibot import pagegenerators
from pywikibot import config
import string
from datetime import datetime
import re
from pywikibot import cosmetic_changes
import urllib
from scripts import zz_ref_link_correction_core
pywikibot.config.put_throttle = 0
pywikibot.config.maxthrottle = 0

testpass=False
cleaning_version='۱۱'
msg='('+cleaning_version +')' 
faSite=pywikibot.Site('fa',fam='wikipedia')
_cache = {}
#-----------------
tags = r'b|big|blockquote|charinsert|code|comment|del|div|em|gallery|hyperlink|i|includeonly|imagemap|inputbox|link|math|noinclude|nowiki|pre|ref|s|small|source|startspace|strong|sub|sup|template|timeline'
faChrs = 'ءاآأإئؤبپتثجچحخدذرزژسشصضطظعغفقکگلمنوهیيككﮑﮐﮏﮎﻜﻛﻚﻙىىىﻴﻳﻲﻱﻰىىﻯيکیہەھ'
langs = 'بلغاری|بنگالی|پارسی باستان|پارسی میانه|پالی|پرتغالی|پشتو|پنجابی|پین‌یینی|تاگالوگ|تامیلی|تاهیتی|تایلندی|ترکمنی|ترکی|ترکی استانبولی|ترکی آذربایجانی|تلگو|جاوه‌ای|چکی|چینی|چینی ساده‌شده|چینی سنتی|دانمارکی|دوناگری|روسی|رومانیایی|ژاپنی|سامی|سانسکریت|سریانی|سکایی|سواحلی|سواحیلی|سوندایی|سوئدی|سیسیلی|صربی|عبری|عربی|فارسی افغانستان|فارسی ایران|فارسی تاجیکی|فارسی سره|فرانسوی|فنلاندی|فیلیپینی|کاتالان|کردی|کره‌ای|کروات|کرواسی|گالیسی|گجراتی|گرجی|گرینلندی|لاتین|لتونیایی|لیتوانیایی|مازندرانی|مالایی|مالزیایی|مجاری|مراتی|مصری|مغولی|مقدونی|نپالی|نروژی|نروژی نو|نورمنی|هاوائی|هائیتیایی|هلندی|هندی|هواسایی|ولزی|ویتنامی|یونانی|یونانی باستان'
zaed = r"''متن مورب''|'''متن ضخیم'''|\[\[پرونده:مثال\.jpg]]|=+ متن عنوان =+|:خط تو رفته\n?|<nowiki>اینجا متن قالب‌بندی‌نشده وارد شود</nowiki>|\# مورد فهرست شماره‌ای\n?|\* مورد فهرست گلوله‌ای|<sub>متن زیرنویس</sub>|<sup>متن بالانویس</sup>|<small>متن کوچک</small>|<big>متن بزرگ</big>|#(؟:تغییرمسیر|REDIRECT) \[\[(?:نام صفحه مقصد|نام صفحه)]]|\{\| class=\.wikitable\.\n\|-\n! متن عنوان !! متن عنوان !! متن عنوان\n\|-\n\| مثال \|\| مثال \|\| مثال\n\|-\n\| مثال \|\| مثال \|\| مثال\n\|-\n\| مثال \|\| مثال \|\| مثال\n\|}|<gallery>\nپرونده:مثال\.jpg\|عنوان ۱\nپرونده:مثال.jpg\|عنوان ۲\n</gallery>|<ref>{{یادکرد\|نویسنده = \|عنوان = \| ناشر = \|صفحه = \|تاریخ = }}</ref>|<ref>{{یادکرد وب\|نویسنده = \|نشانی = \|عنوان = \| ناشر = \|تاریخ = \|تاریخ بازدید = }}</ref>|<ref>{{یادکرد خبر\|نام = \|نام خانوادگی = \|همکاران = \|پیوند = \|عنوان = \|اثر = \| ناشر = \|صفحه = \|تاریخ = \|بازیابی = }}</ref>|\[\[رده:]]|\[\[en:]]|\[\[fa:.*?]]|\[\[عنوان پیوند]]|\{\{\s*}}|\[\[\s*\|?\s*]]|<!-- *?-->|\'\'\'متن ضخیم'\'\'\|'\'متن مورب\'\'|\'\'\'متن پررنگ\'\'\'"#-----------------
bnMazi = '[آا]راست|[آا]را?مید|[آا]زرد|[آا]زمود|[آا]سود|[آا]شامید|[آا]شفت|[آا]فرید|[آا]لا[یئ]ید|[آا]لود|[آا]ما[هس]ید|[آا]مد|[آا]مرزید|[آا]م[یو]خت|آورد|[آا][هو]یخت|[آا]غ[شس]ت|ارزید|افتاد|افراشت|ا?فروخت|افزود|افسرد|ا?فشاند|اف[کگ]ند|انجامید|اند[او]خت|اندیشید|ان[بگ]اشت|نگاشت|انگیخت|ایستاد|با[خف]ت|با[لر]ید|[شب]ایست|بخش[یو]د|برازید|ب[ور]د|[چبپ]رید|[رجشب]ست|بلعید|پ[وا]شید|پخت|پذیرفت|پرا[کگ]ند|پرداخت|پرست?ید|پرورد|پرید|پژمرد|پژوهید|پسندید|پنداشت|[بپ]و[سشی]ید|پیچید|پیراست|پیمود|پیوست|تا[فخ]ت|تپید|ترا[وش]ید|تر[سشک]ید|تکانی?د|تنید|توانست|جن[بگ]ید|[جد]وش?ید|چرخید|چسبید|چ[مکشر]?ید|خر[او]شید|خ[مرز]ید|خشکید|خوابید|خو?است|خواند|خورد|خیسید|داد|داشت|[مد]انست|درخشید|دزدید|دوخت|ربود|راند|ر[مس]ید|رو?فت|رنجید|رو[یئ]ید|ریخت|زد|زدود|زیست|س[وا]خت|سپرد|س[تر]ود|ستیزید|سرشت|سزید|سنجید|ش[تکگ]افت|شد|شک?ست|ش[کگ]فت|شمرد|شناخت|شنید|شورید|طلبید|غلطید|فرستاد|فر[مس]ود|فریفت|فشرد|فهمید|قبولاند|کا[سش]ت|کاوید|ک[نر]د|کشت|کشید|کو[چش]ید|کوفت|گداخت|گذا?شت|گرا[یئ]ید|گردید|گرفت|گروید|گری[خس]ت|گزارد|گزید|گس[تا]رد|گسست|گ[فش]ت|گشود|گماشت|گنجید|ل[رغ]زید|ما[لس]ید|ماند|مرد|نا[مل]ید|نشست|نکوهید|نگاشت|ن?گریست|نمود|نواخت|نوردید|نوشت|نهاد|نهفت|نی?وشید|ور?زید|هراسید|هلید|یازید|یافت'
bnMzare = '[آا]را[یم]|[آا]زار|[آا]ماس|[آا]ز?مای|[آا]سای|[آا]شام|[آا]شوب|[آا]غا[رز]|[آا]فرین|[آا]گن|[آا]لای|[آا]ی|[آا]م[یور]ز|[آا]و?ر|[آا]ویز|[آا]هنج|ارز|افت|افر[او]ز|افزای|افسر|ا?فشان|اف[کگ]ن|انبار|انجام|اندا[یز]|اندوز|اندیش|ا?نگار|انگیز|اوبار|ایست|با[فلیشرز]|بخشای|بخش|براز|ب[َُ]?ر|بند|بساو|بسیج|بلع|بو[یس]?|بیز|پاش|پالای|پ[رز]|پذیر|پرا[کگ]ن|پرداز|پرست?|پرور|پژمر|پژوه|پسند|پلاس|پلک|پناه|پندار|پو[سشیک]|پیچ|پی[مر]ای|پیوند|تا[پز]|تو?پ|ترا[شو]|تر[سشک]|تکان|تن|توان|[نلجد]ه|جن[بگ]|جو[یش]?|چا[یپ]|چ[مکپشفر]|چر[خب]?|چسب?|چلان|چین|خا[یر]|خرا[مش]|خس[بت]|خشک|خروش|خ[ملرز]|خوا[نبه]|خو[فر]|خی[سز]|دا[نر]|درخش|درو?|دزد|[لد]م|دو[شز]?|ربای|ران|رخش|ر[سمه]|رو[یب]?|رشت|رقص|رنج|[بر]ی[نز]|زا[یر]|ز[ین]|زدای|ساز|سپا?ر|سپ؟وز|ستان|ستر|ستیز|سرای|سرشت|س[رز]|سنب|سگال|سنج|سای|شا[شی]|شتاب|شوی?|شک[او]ف|شکن|شکیب|ش[مو]ر|شناس|شنو|طلب|طوف|غارت|غرّ?|غلط|غنو|فرست|فر[سم]ای|فروش|فریب|فشر|فهم|قاپ|قبولان|کا[هرو]|ک[َُِ]?ش|ک[نف]|کو[چشب]|گای|گداز|گذا?ر|گرا[یز]|گرد|گیر|گرو|گریز?|گزار|گز|گزین|گس[تا]ر|گسی?ل|گشای|گو[یز]|گن[جد]|گ[مو]ار|ل[غر]ز|لن[گد]|لیس|ما[سلن]|میر|مک|مو[یل]|نا[زلم]|ن?شین|نکوه|نگا?ر|نمای|نواز|نورد|نویس|نهنب|نی?وش|ور?ز|هراس|هل|یا[برز]'
noAlef = 'باجی|بادانی?|بادی?|بار|باژور|بافت|با[لن]|بانگا[نه]|بتاب|بجی?|بچین|بخس[بت]|بخواره|بخور[دشی]?|بخوست|بخیز|بدارچی|بدارخانه|بدار[وکی]?|بدستان|بدستی?|بدندان|بدنگ|بده|بدیده|براهه?|برفت|برو[دن]|بریز|بریزگان|بزن|بز[یه]|بژ|بسال|بسالان|بست|بستره|بست[نه]|بسکون|بسه|بسوار|بشار|بشتگاه|بشتن?|بشخور|بش[نیش]|بشنگ|بغوره|بفت|بک|بکار|ب‌?کافت|بکا[نم]ه|بکش|بکشین|بکند|بکوهه|بکی|بگاه|بگرد|بگردان|بگز|بگوشت|بگون|بگیر|بگینه|بلوج|بنوس|بوند|بونمان|بونه|بیار|پارات|پارتاید|پارتمان|پاراتی|پاندیس|پاندیسیت|تربان|ترمه|تروپین|تریاد|تشبار|تشبان|تشپا|تشخوار|تشدان|تشفشان|تشک|تشکده|تشگاه|تش[هی]?|تشیزه|تشین|تلیه|ته|تورپات|تیه|ثار|ثام|جاردن|جان|جودان|جید[نه]|جیل|جین|چار|چاردن|چارکشی|چمز|حاد|خال|خت[نه]|خر|خرالامر|خرالزمان|خرت|خردست|خرزمان|خریا؟ن|خ[سش]مه|خشیج|خشیجان|خشیگ|خور|خورچرب|خورخشک|خورسنگین|خوندبازی|خوندک?|دا[بشک]|دامس|دخ|درس|درمه?|درنگ|دمک|دمیت|دمیرال|دمیزاد|دنیس|دیش|دیند?ه|ذار|ذری?|ذربایجانی?|ذربو|ذرجشن|ذرخش|ذریو?ن|ذوقه|ذین|را[یء]|راستن|راسته|رام|رامانیدن|رامش|رامگاه|رامی|رامیدن|رایش|رایشگاه|رایشگر|راییدن|رتروز|رتزین|رتیست|رتیشو|رخالق|ردبیز|رده|ردینه|رزم|رزو|رزوخواه|رزومندی?|رشه|رشیتکت|رشیو|رغ|رغده|رگون|رمان|رمان‌?شهر|رمیچر|رمید[هن]|رن|رنائوت|رنج|رنگ|رواره|روبند|روغ|ری|ریا|ریستوکرات|ریستوکراسی|ریغ|زادگان|زادگی|زادمرد|زاد[یه]?|زادوار|زادی‌?خواه|زار|زارتلخه|زا?رد[نه]|زارنده|زاریدن|زال|زجوی|زخ|زدن|زرد|زردگی|زرم|زرمجو|زرمگین|زری|زغ|زفنداک|زگار|زما|زمایش|زمایشگاه|زماینده|زمایه|زمندی?|زمودگی|زمود[نه]|زمون|زناک|زور|زوغ|زوقه|زیدن|زیر|ژان|ژانس|ژخ|ژدار|ژده|ژغ|ژفنداک|ژگن|ژن[دگ]|ژندن|ژندیدن|ژیانه|ژید[نه]|ژیر|ژیرنده|ژیریدن|ژینه|سان|سانسور|سانی|سایش|سایشگاه|ساینده|ساییدن|سبان|سپیرین|ستانه|ستر|ستیگماتیسم|ستی[من]ه?|سدست|سغده|سفالت|سکاریس|سمانخانه|سمانخراش|سمان[هی]?|سموغ|سه|سودگی|سود[نه]|سیابان|سیاچرخ|سیازنه|سیاکردن|سیا[وب]?|سیایی|سیب|سیل|سی[من]ه|سیون|شا[بم]|شامیدن|شانه|شپز|شپزخانه|شتالنگ|شت[می]|شخال|شخانه|شردن|شرمه|شفتگی|شفت[نه]?|شکار|شکارساز|شکاره|شکوبه|شکو[بخ]?|شکوخیدن|شگر|شمالی?|شموغ|شنا|شناگر|شنا[هو]|شناوری|شنایی|شوب|شوب‌?گر|شوبیدن?|شور|شوردن|شوریده|شوغ|شوفتن|شیانه|شیهه|صال|غُش|غا|غاجی|غار|غاردن|غاری|غاریدن|غازگر|غاز[هی]?|غازیدن|غالش?|غالنده|غالید[نه]|غچه|غردن|غری?|غز|غ[سش]ت[نه]|غل|غندن|غنده|غو[زشل]|غوشیدن|غیل|فا[تق]|فاقی|فتاب[هی]?|فتومات|فدم|فرنگ|فروشه|فریدگار|فرید[نه]|فرین|فرینگان|فریننده|فگانه|فل|فند|فندیدن|فیش|ق|قا|قازاده|قاسی|ق‌?بانو|قچه|قسنقر|قشام|قطی|قورایی|قوش|کادمیک?|کاردئون|کام|ک[بپج]|کبند|کتریس|کتور|کروبات|کروباسی|کستن|ککرا|کله|کند[نه]|کنش|کنه|کنیدن|کواریوم|کوستیک|کولاد|کومولاتور|گاهاندن|گاهی?|گ[پج]|گراندیسمان|گرمان|گشتن|گفت|گنج|گنده|گهی|گو|گور|گورگر|گو[شن]|گیشیدن|گی[من]|لاپلنگی|لات|لاچیق|لاخون|لاس|لاسکا|لاگارسون|لامد?|لاوه?|لایش|لاییدن|لبالو|لبوم|لبومین|لپر|لت|لترناتیو|لر|لرژی|ل[شغ]|لغده|لفا|لفت[نه]|لکالویید|لگرو|لگونه|لوچه|لودگی|لود[نه]|لوسن|لومین|لومینیوم|لو[ئن]ک|لیاژ|لیداد|لیزیدن|ماتور|ماج|ماجگاه|مادگی|ماده|مار|مارگر|ماریدن|ماریلیس|ماس|ماسانیدن|ماسیدن|ماق|مال|مانی|ماهانیدن|ماهیدن|مبولانس|مپر|مپرسنج|مپلی|مپول|مپی|مخته|مدگان|مدن?|مرانه|مرزش|مرزگار|مرزنده|مرزیدن|مرزیده|مرغ|مریکا|مریکایی?|مفی|مفیبول|مه|موت|موخت[نه]|مود[نه]|موزانه|موزشی?|موزشیار|موزگا[رن]|موزنده|موزه|موق|موکسی|مولن|مون|مونیاک|میب|میختگی|میخت[نه]|میز[شه]?|میزگاری?|میغه?|نابولیسم|نات?|ناتومی|نارشی|نارشیس[تم]ی?|ناس|نالوگ|نالیز|نام|ناناس|نتراکت|نتریک|نت[نی]|نتیک|نجا|نچت?|ندوتوکسین|ندودرم|ندوسپرم|ندوسکوپی|ندون|نرمال|نزیم|نژین|نژیوکت|نژیوگرافی|نسه|نسیلین|نک|نگلوفیل|نوریسم|نیلین|نین|نیه|نیون|هار|هاردن|هازیدن|هستگی|هسته|هک|همند|هنج|هنجیدن|هنگ[ری]?|هنگساز|هنین|هو|هوانگیز|هوپا|هوتک|هوچشم|هودل|هوفغند|هومند|هون|هیانه|هیختن|واخ|وارگی|وا[رز]ه?|واشناسی|واکس|وام|وانتاژ|وانس|وانگارد|وانویسی|وردجو|وردگا؟ه|وردن|وردیدن|ورک|ورنجن|وری|وریدن|وریل|ونگ|ونگان|ونگون|ویخت[نه]|ویزش?|ویزگ?ان|وی[زژ]ه|ویزون|ویشن|یا[تن]?|یبک|یتم?|یزنه|یژ|یفت|یفون|ینده|یه|ییژ|یین|[یئ]?ینه|ئورت'
tnvindar = '(الزاما|لزوما|یقینا|قطعا|حتما|قاعدتا|طبیعتا|طبعا|قهرا|جدّا|حقیقتا|واقعا|مطمئنا|واضحا|مسلما|تماما|کاملا|عینا|اکیدا|مطلقا|دقیقا|مستقیما|اصولا|اصلا|اصالتا|نسبا|نسبتا|تقریبا|حدودا|معمولا|عرفا|قانونا|شرعا|اخلاقا|خلقا|احتمالا|استثنائا|اساسا|کلّ?ا|جزئا|مجموعا|جمعا|اجماعا|شدیدا|نهایتا|اقلا|اکثرا|غالبا|عمدتا|ندرتا|بعضا|گاها|صریحا|صراحتا|عموما|اختصاصا|خصوصا|مجملا|اجمالا|اختصارا|مختصرا|مشروحا|ظاهرا|باطنا|عمیقا|ذاتا|فطرتا|روحا|جسما|ابتدائا|مقدمتا|بدوا|بعدا|قبلا|جدیدا|سابقا|اخیرا|ابدا|عمرا|تلویحا|علنا|حضورا|غیابا|نیابتا|لطفا|اجبارا|اختیارا|عالما|عمدا|عامدا|تعمدا|متعمدا|عادتا|مستقلا|احتیاطا|احیانا|غفلتا|سهوا|اشتباها|عاجلا|عجالتا|مرتجلا|ارتجالا|سریعا|فورا|دا[یئ]ما|ضرورتا|نقدا|منحصرا|صرفا|دفعتا|کرارا|مکررا|مجددا|مرتبا|مستمرا|متواترا|تدریجا|تصادفا|عملا|فعلا|موقتا|ضمنا|نتیجتا|نوعا|اصطلاحا|جسارتا|بالا ?غیرتا|م[وؤ]کدا|ذیلا|شخصا|مشترکا|مفصلا|رسما|ترجیحا|قلبا|ر[اأ]سا|تو[اأ]ما|متناوبا|متوالیا|متقابلا|متعاقبا|متّ?فقا|مثلا|فرضا|ایضا|مضافا|مصرّ?ا|ارفاقا|انصافا|جهارا|طولا|متدرجا|غانما|احتراما|ناچارا|سفارشا|تلفنا|زبانا|کتبا|شفاها|سوما|چهارما|ثانیا|ثالثا|رابعا|خامسا|سادسا|سابعا|ثامنا|تاسعا|عاشرا)'#اکساندر دوما!
sametH = r'فرمانده|زره|کوه|گره|گنه|سپه|مکروه|م?ت?وجّ?ه|منزّ?ه|نزه|ابله|مرفّ?ه|شبیه|مت?شابه|کریه|پادشه|اللّ?ه|اله|[آکبتدرزشلم]ه' #e: صامت هـ
spcBfre = '.،,:؛;؟٫)}]»》”，·。一ｰ・、：（）「」〜？！ء'
spcAftr = '({[«《“，·。一ｰ٫・、：（）「」〜？！'
bLA = '(?!['+faChrs+'])'
bLB = '(?<!['+faChrs+'])'
site_category=r'رده'
#--------------------------------------fa_replaceExcept---------------------
TEMP_REGEX = re.compile(
    '{{(?:msg:)?(?P<name>[^{\|]+?)(?:\|(?P<params>[^{]+?(?:{[^{]+?}[^{]*?)?))?}}')

def findmarker(text, startwith='@@', append=None):
    # find a string which is not part of text
    if not append:
        append = '@'
    mymarker = startwith
    while mymarker in text:
        mymarker += append
    return mymarker
        
def minor_edits (text):
    text=text.replace('\r','')    
    text=text.replace('\n \n \n','\n\n').replace('\n \n','\n\n').replace('\n \n','\n\n').replace('\n  \n','\n\n').replace("--------",'----').replace("-----",'----').replace("--------",'----').replace("-----",'----')
    text = re.sub(r'[\r\n]{3,}', r"\n\n",text)
    text=text.replace('[[ ','[[').replace(' ]]',']]').replace(' }}','}}').replace('{{ ','{{').replace('< ','<').replace('</ ','</').replace(' />','/>').replace('<!--\n','<!--').replace('\n-->','-->').replace('<!---\n','<!---').replace('\n--->','--->')
    text=text.replace('[[ ','[[').replace(' ]]',']]').replace(' }}','}}').replace('{{ ','{{').replace('==  ','== ').replace('==  ','== ').replace('  ==',' ==').replace('  ==',' ==')
    text=fa_replaceExcept(text,' >','>', ['math', 'pre', 'template', 'timeline', 'ref', 'source', 'startspace'])
    text=text.replace('\n<ref','<ref').replace('</ref>\n<ref','</ref><ref')
    text = re.sub(re.compile(r'^(\=+)\s*(.*?)\s*(\=+)$', re.MULTILINE), r"\1 \2 \3",text)
    text=text.replace('\n\n*','\n*').replace('\n\n#','\n#')
    #a: الگوافزایی
    if text.find('{{پانویس')==-1:
        if text.find('= منابع =') !=-1:
          text = re.sub(r'(= منابع =+\n)', r'\1{{پانویس}}\n', text, re.S)
    text=finall_cleaning(text)
    minor_text=text.strip()
    return minor_text
    
def arabic_to_farsi(text):
    exceptions = ['gallery', 'hyperlink', 'interwiki', 'math', 'pre', 'template', 'timeline', 'ref', 'source', 'startspace', 'inputbox','file','URL']
    text2=text
    while True:
        text = fa_replaceExcept(text, r'[كﮑﮐﮏﮎﻜﻛﻚﻙ]', r'ک', exceptions)
        text = fa_replaceExcept(text, r'[ىىىﻴﻳﻲﻱﻰىىﻯي]', r'ی', exceptions)
        text = fa_replaceExcept(text, r'[ہەھ]', r'ه', exceptions)
        if text==text2:
           break
        text2=text
    return text

    
def dictation(txt,msg_short,msg=msg):
    old_txt=txt
    #s: شبه‌ساده‌ها  ####### مشارٌ‌اليه، مضاف‌ٌاليه، منقولٌ‌عنه، مختلفٌ‌فيه، متفق‌ٌعليه، بعبارةٍاُخرى، اباًعن‌جدٍ، اىّ‌نحوٍكان.
    #txt = re.sub(bLB+'من ?(باب|جمله)'+bLA, r'من‌\1', txt)
    txt = re.sub(r' مع ?(هذا|ذلک|الفار[غق]|الوصف|ال[اأ]سف)', r' مع‌\1', txt)
    txt = re.sub(r' علی ?(هذا|حده|رغم|الاصول|الحساب|الخصوص|البدل|الدوام|السویه|الطلوع|الله|القاعده)', r' علی‌\1', txt)
    txt = re.sub(bLB+' ذو ال', ' ذوال', txt)
    txt = re.sub(r' ذی ?(ال|نفع|امر|جود|حساب|حق|حیات|ربط|روح|شعور|صلاح|صلاحیّ?ت|عقل|علاقه|فقار|فن|قیمت|نفوذ)'+bLA, r' ذی‌\1', txt)
    txt = re.sub(bLB+' حقّ? (?=البوق|العبور|الت[اأ]لیف|التدریس|الزحمه|اللّ?ه|النّ?اس|تعالی)', ' حق‌', txt)
    txt = re.sub(r' عن ?[قغ]ریب', r' عن‌قریب', txt)
    #txt = re.sub(r' قتل ?عام', r' قتل‌عام', txt)
    txt = re.sub(r' علی[‌ ][اأ]یّ?[‌ ]?حال', r' علی‌أی‌حال', txt)
    txt = re.sub(r' من[‌ ]?حیث[‌ ]?المجموع', r' من‌حیث‌المجموع', txt)
    txt = re.sub(r'ب(?:|ه[‌ ])ر[اأ]ی[‌ ]العین', r'برأی‌العین', txt)
    txt = re.sub(r'ما ?ب(?:|ه[‌ ])ازا', 'مابازا', txt)
    txt = re.sub(r'متقابل[‌ ](?:ب|به[‌ ])ر[اأ]س', r'متقابل‌به‌رأس', txt)
    #txt = re.sub(r'منحصر ?(?:ب|به[‌ ])فرد', r'منحصربه‌فرد', txt)
    txt = re.sub(bLB+r'فی[‌ ]?ما ?بین', r'فی‌مابین', txt)
    txt = re.sub(r' [اآ]ی[ةت][‌ ]?اللّ?ه', r' آیت‌الله', txt)#عنایت‌الله
    txt = re.sub(r'حج[ةته][‌ ]?ال[اإ]سلام', r'حجت‌الاسلام', txt)
    txt = re.sub(r'ثق[ةته][‌ ]?ال[اإ]سلام', r'ثقةالاسلام', txt)
    txt = re.sub(r'امیر ?الم[وؤ]منین', r'امیرالمؤمنین', txt)
    txt = re.sub(r'(متوازی|مختلف)[‌ ]?ال[اأ]ضلاع', r'\1‌الأضلاع', txt)
    txt = re.sub(r'متساوی[‌ ]?السّ?اقین', r'متساوی‌الساقین', txt)
    txt = re.sub(r'قا[یئ]م[‌ ]الزّاوی[ةه]', r'قائم‌الزاویه', txt)
    txt = re.sub(r'دا[یئ]ر[ةته][‌ ]?(البروج|المعارف|العلوم)', r'دائرة\1', txt)
    txt = re.sub(r'دا[یئ]م[‌ ](الخمر|الصوم|الذّ?[کك]ر)', r'دائم‌\1', txt)
    txt = re.sub(r'ر[اأإ]س[‌ ](الجدی|السّ?رطان|المال)', r'رأس‌\1', txt)
    txt = re.sub(r'(مجنی|مجنی)[‌ ][عا]لیه', r'\1‌علیه', txt)
    txt = re.sub(r'(مضاف|مسند|مرجوع|مشار|منتقل)ٌ?[‌ ]?[عا]لیه', r'\1ٌ‌الیه', txt)
    txt = re.sub(r'منته[ای][‌ ]?[عا]لیه', r'منتهی‌الیه', txt)
    txt = txt.replace('بین الملل', 'بین‌الملل').replace('نرم افزار', 'نرم‌افزار').replace('حزب الل', 'حزب‌الل')
    txt = txt.replace('جدید الاحداث', 'جدیدالاحداث').replace('کثیر الانتشار', 'کثیرالانتشار').replace('سریع السیر', 'سریع‌السیر')
    txt = txt.replace('لازم الاجرا', 'لازم‌الاجرا').replace('فوق الذکر', 'فوق‌الذکر').replace('مرضی الطرف', 'مرضی‌الطرف')
    txt = txt.replace('خاتم الانبیا', 'خاتم‌الانبیا').replace('متفق القول', 'متفق‌القول').replace('قریب الوقوع', 'قریب‌الوقوع')
    txt = txt.replace('سوق الجیشی', 'سوق‌الجیشی').replace('محیر العق', 'محیرالعق').replace('عظیم الجث', 'عظیم‌الجث')
    txt = txt.replace('لطایف الحیل', 'لطایف‌الحیل').replace('موقوف المعانی', 'موقوف‌المعانی').replace('سلیم النفس', 'سلیم‌النفس')
    txt = txt.replace('موثق الصدور', 'موثق‌الصدور').replace('شمس العمار', 'شمس‌العمار').replace('حسب الامر', 'حسب‌الامر')
    txt = txt.replace('مسلوب الاراده', 'مسلوب‌الاراده').replace('مستجاب الدعو', 'مستجاب‌الدعو')
    txt = re.sub(bLB+'(دار|مشترک|ممنوع|قدیم|قلیل|ناقص|ضعیف|قوی|تحت|ر[یئ]یس|ربّ?|امّ?|حقّ?|ماء|ماوراء|باب) (?=ال)', r'\1‌', txt)
   #txt = re.sub('‌(?=الهام|الصاق|الزام|القا|الکتریک|الکتریسیته)', '', txt)

    #e: اً
    txt = re.sub(bLB+tnvindar+bLA, r'\1ً', txt)
    txt = re.sub(r'اصلاً? ?و ?ابداً?', r'اصلا و ابدا', txt)
    txt = re.sub(r'اهلاً? ?و ?سهلاً?', r'اهلاً وسهلاً', txt)
    txt = re.sub(r'ً'+r'['+r'ًٌٍَُِّْْ'+r']', r'ً', txt)#remove double erab

    #e: آ
    #txt = re.sub(bLB+'(ا|أ)('+noAlef+')'+bLA, r"آ\2", txt)#it has some bugs!
    txt = txt.replace(' راکتور', ' رآکتور').replace('فرآیند', 'فرایند').replace('فرآورده', 'فراورده')# e: ا <-> آ
    txt = re.sub(bLB+r'ایده?[‌ ][اآ]ل', r'ایده‌آل', txt)
    #s: افعال
    txt = txt.replace(' دو میدانی ', ' دومیدانی ')
    txt = re.sub(bLB+'(نمی) ?([نب]ی؟|)('+bnMzare+'|'+bnMazi+')(ان|)(م|ی|د|یم|ید|ا?ند)'+bLA, r'\1‌\2\3\4\5', txt) # می bug همیاری
    #txt = re.sub(bLB+'(باز|فر[او]|وا|[بد]ر) ?([هن]?می‌|)([منب]ی?|)('+bnMzare+'|'+bnMazi+')(م|ی|د|یم|ید|ا?ند)'+bLA, r'\1\2\3\4\5', txt) # پیشوند فعل ### BUG
    txt = re.sub(bLB+'(باز|فر[او]|وا) ?([منب]ی?|)('+bnMazi+')ن'+bLA, r'\1\2\3ن', txt)#وی در جنگیدن با من
    txt = re.sub(bLB+'('+bnMazi+')ه (ام |ای |ایم |اید |اند )'+bLA, r'\1ه‌\2', txt) # فم بین «ه» و شناسه طبق شیوه‌نامه است باید جدا باشد
    txt = re.sub('([منب])یا(رزید|فتاد|فتد|فراشت|فروخت|فزود|فسرد|فشاند|ف[کگ]ند|نجامید|ند[او]خت|ندیشید|ن[بگ]اشت|نگیخت)(م|ی|یم|ید|ند|[^'+faChrs+'])', r'\1ی\2', txt) # نیافتاد -> نیفتاد
    txt = re.sub('([منب])یا(رز|فر[او]ز|فزای|فسر|فشان|ف[کگ]ن|نبار|نجام|ندا[یز]|ندوز|ندیش|نگار|نگیز)(م|ی|د|یم|ید|ا?ند|[^'+faChrs+'])', r'\1ی\2\3', txt) # بیاندیش -> بیندیش

    #s: ضمایر ملکی
    txt = re.sub('(?:ه|هٔ)[‌ ](مان|تان|شان)'+bLA, r'ه‌\1', txt)#BUG:Solved
    txt = re.sub('(?<=ه)[‌ ](ام |ات |اش )'+bLA, r'‌\1', txt)

    #s: و
    txt = re.sub('رفت[‌ ]?و ?[اآ]مد', 'رفت‌وآمد', txt)
    txt = re.sub('گفت[‌ ]?و ?گو', 'گفتگو', txt)
    txt = re.sub('جست[‌ ]?و ?جو', 'جستجو', txt)
    txt = re.sub('پخت[‌ ]?و ?پز', 'پخت‌وپز', txt)
    txt = re.sub('شست[‌ ]?و ?شو', 'شست‌وشو', txt)
    txt = re.sub('خفت[‌ ]?و ?خیز', 'خفت‌وخیز', txt)
    txt = re.sub(bLB+'کند ?و ?کا?و'+bLA, 'کندوکاو', txt)
    txt = re.sub(bLB+'کم[‌ ]و ?کاست', 'کم‌وکاست', txt)

    #s: بسیط
    txt = re.sub('(فن|دل)ّ?[‌ ]?[آا]وری', r'\1اوری', txt)    
    txt = re.sub(bLB+' دل[‌ ](سوزی|تنگی|بری) '+bLA, r' دل\1 ', txt)#Bug دل بریدن
    txt = re.sub(bLB+'یک[‌ ]دلی'+bLA, 'یکدلی', txt)
    txt = re.sub('گاه[‌ ]و ?بی[‌ ]?گاه', 'گاه‌و‌بیگاه', txt)

    #e: دیگر غلط‌های املایی
    txt = re.sub(' (سپاس|شکر|بر)[‌ ]?گ[ذز]ار ', r' \1‌گزار ', txt)#بنا بر گزارش
    txt = re.sub('(پایه|بنیان)[‌ ]?گزار', r'\1‌گذار', txt)#متغییر الگو بنیانگذار
    txt = re.sub(bLB+'بی[‌ ]?م[حه]ابا', 'بی‌محابا', txt)
    txt = re.sub(bLB+' بر ?خو?است', ' برخاست', txt)
    txt = re.sub('خوانواد(?=ه|گی)', 'خانواد', txt)
    txt = re.sub('[آا]نفو?لو? ?[آا]نزا', 'آنفلوانزا', txt)
    txt = re.sub(bLB+'غری[ضظ]ه'+bLA, 'غریزه', txt)
    txt = txt.replace('خواستگاه', 'خاستگاه')
    txt = txt.replace('اطاق', 'اتاق').replace('باطری', 'باتری').replace('باطلاق', 'باتلاق').replace(' ملیون', ' میلیون')
    txt = txt.replace('ضمینه', 'زمینه').replace('انظباط', 'انضباط').replace('حاظر', 'حاضر')
    #txt = txt.replace('نفوظ', 'نفوذ') ###
    txt = txt.replace('مذبور', 'مزبور').replace('قائله', 'غائله').replace(' وحله', ' وهله').replace(' مرهمت', ' مرحمت')    
    txt = txt.replace(' انهنا', ' انحنا').replace('پزشگی', 'پزشکی').replace('تضاهرات', 'تظاهرات')
    txt = txt.replace('تلوزیون', 'تلویزیون').replace('پرفسور', 'پروفسور').replace(' خوشنود', ' خشنود')
    txt = txt.replace(' الویت', ' اولویت').replace('ملیارد', 'میلیارد')
    txt = re.sub('ه‌(گی|گانی?)'+bLA, r'\1', txt)
    #txt = re.sub(bLB+'وب[‌ ]?(سایت|گاه)', 'وبگاه', txt) ###in many cases it could be template vaiable!
    txt = re.sub('ویکی ?(?=سازی|فا |[مپ]دیا)', 'ویکی‌', txt)
    txt = re.sub('ویکی‌پدیا ?(?='+langs+')', 'ویکی‌پدیای ', txt)
    txt = re.sub('علاقه?[‌ ]?مند', 'علاقه‌مند', txt)
    txt = re.sub(' باقی ?مانده ', ' باقی‌مانده ', txt)
    txt = re.sub('مت[عاأ][سص]ّ?فانه', 'متأسفانه', txt)

    txt = re.sub(bLB+' من[‌ ]را'+bLA, ' مرا', txt)
    #txt = re.sub('عدم وجود'+bLA, 'نبودِ', txt)
    #txt = txt.replace('عدم حضور', 'غیاب')
    txt = re.sub('اقدامات لازمه?'+bLA, 'اقدام‌های لازم', txt)

    #e: ماه‌ها
    #txt = re.sub(bLB+'مارچ'+bLA, 'مارس', txt)#BUG می‌تواند اسم شخص هم باشد
    txt = re.sub(bLB+'[اآ]ی?پریل'+bLA, 'آوریل', txt)    
    txt = re.sub(bLB+'(?:جولای|ژوییه)'+bLA, 'ژوئیه', txt)
    #txt = re.sub(bLB+'[اآ]گوست'+bLA, 'اوت', txt)#جین آگوست دومینیک
    txt = re.sub(bLB+'دی?سا?مبر'+bLA, 'دسامبر', txt)
    txt = re.sub('(ربیع|جمادی)[‌ ]?(?:الثانی|ال[اأإ]خر)', r'\1‌الثانی', txt)
    txt = re.sub('(ربیع|جمادی)[‌ ]?ال[اأإ]ول', r'\1‌الاول', txt)
    #txt = re.sub('ذ[وی][‌ ]?(?:ال|)(حج|قعد)[ةه]', r'ذی‌ال\1ه', txt) ###
    
    #e: جمع‌الجمع
    txt = re.sub('(مدارک)[‌ ]?های?'+bLA, 'مدارک', txt)
    txt = re.sub(bLB+'رسومات'+bLA, 'رسوم', txt)
        
       
    #e: حشو
    txt = re.sub(bLB+'بر ?علیه', 'علیه', txt) # بر علیه
    txt = re.sub('اعلم[‌ ]?تر', 'اعلم', txt) # تر

    #e: طبق قاعدهٔ فارسی
    txt = re.sub('(آزمایش|پژوهش|پیشنهاد|نمایش|دستور|فرمایش|گزارش|گرایش|باغ|کوهستان)اتی ', r'\1‌هایی ', txt) # اتی -> هایی
    txt = txt.replace('بازرسین', 'بازرسان').replace('داوطلبین', 'داوطلبان') #e: ین -> ان
    txt = re.sub(bLB+'(رهبر|خوب|بد|من)یّ?ت', r'\1ی', txt) # یّت -> ی
    txt = re.sub(bLB+'دو[یئ]یت', 'دوگانگی', txt) # یّت
    txt = txt.replace('زباناً', 'زبانی').replace('تلفناً', 'تلفنی').replace('ناچاراً', 'به‌ناچار').replace('گاهاً', 'گاهی') #e: اً
    #--------------------------Reza added------------------------

    if old_txt!=txt:
        if msg_short:
            msg='املا+'+msg    
        else:
            msg='اشتباه نگارشی + '+msg
    return txt.strip(),msg

def cleaning(text,msg_short,msg=msg):    
    old_text=text
        
    text=text.replace('\r','').replace('\n^ "','\n*"').replace('&zwnj;','‌').replace('\n \n \n','\n\n').replace('\n \n','\n\n').replace('\n \n','\n\n').replace('\n  \n','\n\n')
    text=text.replace('< ','<').replace(' >','>').replace('<!--\n','<!--').replace('\n-->','-->').replace('<!---\n','<!---').replace('\n--->','--->')
    #تمیزکاری فاصلهٔ مجازی
    text = re.sub('(\u202A|\u202B|\u202C|\u202D|\u202E|\u200F)','\u200C', text)#حذف کارکترهای تغییرجهت
    text = re.sub('‌{2,}', '‌', text) # پشت‌سرهم
    text = re.sub('‌(?![ئاآأإژزرذدوؤةبپتثجچحخسشصضطظعغفقکگلمنهیيًٌٍَُِّْٰٓٔكﮑﮐﮏﮎﻜﻛﻚﻙىىىﻴﻳﻲﻱﻰىىﻯيکیہەھ]|[\u0900-\u097F]|ֹ)', '', text) # در پس
    text = re.sub('(?<![ئبپتثجچحخسشصضطظعغفقکگلمنهیيًٌٍَُِّْٰٓٔكﮑﮐﮏﮎﻜﻛﻚﻙىىىﻴﻳﻲﻱﻰىىﻯيکیہەھ]|[\u0900-\u097F]|f|ֹ)‌', '', text) # در پیش
    text=arabic_to_farsi(text)
    
    text = re.sub("(?:"+zaed+")", "", text)
    #اصلاح شماره‌بندی
    text=text.replace('\n•','\n*')
    text=text.replace('\n\n*','\n*').replace('\n\n#','\n#').replace('\n# \n','\n#').replace('\n#\n','\n#').replace('\n*\n','\n*').replace('\n* \n','\n*').replace('\n*==','\n==').replace('\n#==','\n==').replace('\n* ==','\n==').replace('\n# ==','\n==')
    text=text.replace('\n\n**','\n**').replace('\n\n##','\n##').replace('\n## \n','\n##').replace('\n##\n','\n##').replace('\n**\n','\n**').replace('\n** \n','\n**').replace('\n**==','\n==').replace('\n##==','\n==').replace('\n** ==','\n==').replace('\n## ==','\n==') 
    #text = re.sub(re.compile(r'^[\d۰-۹]+\s*[-_ـ–]\s*(.*)(\n|<br \/>)(?=\n)', re.MULTILINE), r"# \1",text)
    
    #تمیزکاری عنوان 
    #----cleaning for subsections -----
    
    text=text.replace('<br/>','{{سخ}}').replace('<br>','{{سخ}}').replace('{{سر خط}}','{{سخ}}').replace('{{سرخط}}','{{سخ}}').replace('<br/>','{{سخ}}').replace('</br>','{{سخ}}').replace('< /br>','{{سخ}}').replace('<br />','{{سخ}}')
    if '{|' in text:
        text_table=text.split('{|')[1].split('|}')[0]
        text1=re.sub(r"(\n\{\{سخ\}\}|\n\n)\'\'\'(.*?)\'\'\'[\s_](\{\{سخ\}\}\n|\n\n)",r"\n\n== \2 ==\n\n",text_table)
        text1=re.sub(r"(\n\{\{سخ\}\}|\n\n)\'\'\'(.*?)\'\'\'(\{\{سخ\}\}\n|\n\n)",r"\n\n== \2 ==\n\n",text1)
        text1=re.sub(r"(\n\{\{سخ\}\}|\n\n)[\s_]\'\'\'(.*?)\'\'\'(\{\{سخ\}\}\n|\n\n)",r"\n\n== \2 ==\n\n",text1)
        text1=re.sub(r"\n\n\'\'\'(.*?)\'\'\'(\s)\n\n",r"\n\n== \1 ==\n\n",text1)
        text1=re.sub(r"\n\n\'\'\'(.*?)\'\'\'(\s)\n\n",r"\n\n== \1 ==\n\n",text1)
        text1=re.sub(r"\n\n\'\'\'(.*?)\'\'\'(\s)\n([\n\#\*])",r"\n\n== \1 ==\n\3",text1)
        if text1 == text_table:
            thepass=True
        else:
            thepass=False
        del text1, text_table
    else:
        thepass=True
    if thepass:
        text=re.sub(r"(\n\{\{سخ\}\}|\n\n)\'\'\'(.*?)\'\'\'[\s_](\{\{سخ\}\}\n|\n\n)",r"\n\n== \2 ==\n\n",text)
        text=re.sub(r"(\n\{\{سخ\}\}|\n\n)\'\'\'(.*?)\'\'\'(\{\{سخ\}\}\n|\n\n)",r"\n\n== \2 ==\n\n",text)
        text=re.sub(r"(\n\{\{سخ\}\}|\n\n)[\s_]\'\'\'(.*?)\'\'\'(\{\{سخ\}\}\n|\n\n)",r"\n\n== \2 ==\n\n",text)
        text=re.sub(r"\n\n\'\'\'(.*?)\'\'\'(\s)\n\n",r"\n\n== \1 ==\n\n",text)
        text=re.sub(r"\n\n\'\'\'(.*?)\'\'\'(\s)\n\n",r"\n\n== \1 ==\n\n",text)
        text=re.sub(r"\n\n\'\'\'(.*?)\'\'\'(\s)\n([\n\#\*])",r"\n\n== \1 ==\n\3",text)

    text = re.sub(re.compile(r'^(\=+)\s*(.*?)\s*(\=+)$', re.MULTILINE), r"\1 \2 \3",text).replace("==  ",'== ').replace("  ==",' ==')    
    for i in range(0,40):
        text=text.replace("=  =",'==').replace("=   =",'==')
        text=text.replace("--------",'----').replace("-----",'----')
    text=text.replace('== "','== ').replace('" ==',' ==') 
    text=text.replace("== '''",'== ').replace("''' == ",' ==')
    text=text.replace("=='''",'==').replace("'''== ",'==')
    
    for i in ".:,;&^#@•→←↔↑↓…~٫،؛ٔ*":
        text=text.replace("== "+i,"== ").replace(i+" =="," ==").replace("\n\n"+i+"\n\n","\n\n").replace("=\n"+i+"\n\n","=\n\n")

    if text.find('==')==-1:    
        text = re.sub(re.compile(r'^\=([^\=\r\n]+)\=$', re.MULTILINE), r"== \1 ==",text)
    #----cleaning for links and wiki syntaxes-----
    text=text.replace('[[ ','[[').replace(' ]]',']]').replace(' }}','}}').replace('{{ ','{{').replace('< ','<').replace(' >','>').replace('</ ','</').replace(' />','/>')
    text=text.replace('[[ ','[[').replace(' ]]',']]').replace(' }}','}}').replace('{{ ','{{').replace('==  ','== ').replace('==  ','== ').replace('  ==',' ==').replace('  ==',' ==')
    text=text.replace('\n ]]\n',']]\n').replace('\n]]\n',']]\n')
    
    #----cleaning for images-----
    text=text.replace('\r','').replace('{{audio||Play}}','').replace('<gallery>\n\n</gallery>','').replace('<gallery>\n</gallery>','').replace('<gallery></gallery>','')
    text = re.sub(r'\[\[ *(?:[Cc]ategory|رده):', '[[رده:', text)
    text = re.sub(r'\{\{ *(?:[Tt]emplate|الگو):', '{{', text)
    text = re.sub(r'\[\[ *(?:[Ii]mage|[Ff]ile|تصویر|تصوير):', '[[پرونده:', text)
    text=text.replace('تصویر:','پرونده:').replace('تصوير:','پرونده:').replace('پرونده:تصویر:','پرونده:')
    text=text.replace('پرونده:پرونده:','پرونده:').replace('پرونده:تصوير:','پرونده:')
    text=text.replace('تصویر:|\n','')
    text=text.replace('پرونده:|\n','')
    text=text.replace('تصوير:|\n','')     
    #e: عنوان‌ها
    txet=text.replace('<small>','{{کوچک}}').replace('</small>','{{پایان کوچک}}')
    text=text.replace('== منابع ==\n\n== منابع ==','== منابع ==').replace('== منابع ==\n\n\n== منابع ==','== منابع ==').replace('== منابع ==\n== منابع ==','== منابع ==')
    
    text = re.sub(r'\=\s*پانو[یي]س[‌ ]?(?:ها)?\s*\=', '= پانویس =', text)
    text = re.sub(r'\=\s*گالر[یي]\s*\=', '= نگارخانه =', text)
    text = re.sub(r'\=\s*نگارستان\s*\=', '= نگارخانه =', text)
    text = re.sub(r'\=\s*پاورقی\s*\=', '= پانویس‌ها =', text)
    text = re.sub(r'\=\s*پاورقی‌ها\s*\=', '= پانویس‌ها =', text)    
    text = re.sub(r'\=\s*لیست\s*\=', '= فهرست =', text)    
    text = re.sub(r'\=\s*جُ?ستار(?:ها[یي])? (?:وابسته|د[یي]گر|مرتبط|مشابه)\s*\=', '= جستارهای وابسته =', text)
    text = re.sub(r'\=\s*(?:همچنین ببینید|ببینید)\s*\=', '= جستارهای وابسته =', text)
    text = re.sub(r'\=\s*(?:منبع|منبع[‌ ]?ها|رفرنس|رفرنس[‌ ]?ها|ارجاع[‌ ]?ها|ارجاع|مرجع[‌ ]?ها|رفرنس|برگرفته از|مراجع|منابع و یادداشت[‌ ]?ها|منبع|مرجع|فهرست مراجع|لیست مراجع|فهرست ارجاع[‌ ]?ها|فهرست ارجاع)\s*\=', '= منابع =', text)
    text = re.sub(r'\=\s*(?:پ[یي]وند|ل[یي]ن[کك])[‌ ]?(?:ها[یي])? (?:به ب[یي]رون|ب[یي]رون[یي]|خارج[یي])\s*\=', '= پیوند به بیرون =', text)
    text=text.replace('= همچنین ببینید =','= جستارهای وابسته =').replace('=همچنین ببینید=','= جستارهای وابسته =').replace('=مطالب مرتبط=','= جستارهای وابسته =').replace('= مطالب مرتبط =','= جستارهای وابسته =').replace('= مطلب مرتبط =','= جستارهای وابسته =').replace('=مطلب مرتبط=','= جستارهای وابسته =')
    #e: <ref> & {{پانویس}}
    text = re.sub(r'<(?:\s*|\s*/\s*)references?(?:\s*|\s*/\s*)>', '{{پانویس}}', text).replace('<references />','{{پانویس}}').replace('<references/>','{{پانویس}}')
    text = re.sub(r'{{(?:[Rr]eflist|[Rr]eferences?|پانویس[‌ ]?ها)(?=\||})', '{{پانویس', text)
    text = re.sub(r'{{(پایان|آغاز|) ?(چپ|راست|وسط)[‌ ]?چین}}', r'{{\1 \2‌چین}}', text).replace('{{ چپ‌چین}}','{{چپ‌چین}}').replace('{{ راست‌چین}}','{{راست‌چین}}')
    text = re.sub(r'{{راست‌چین}}\s*{{پانویس(.*?)}}\s*{{پایان راست‌چین}}', r'{{پانویس\1}}', text, re.S)
    text = re.sub(r'{{چپ‌چین}}\s*{{پانویس(.*?)}}\s*{{پایان چپ‌چین}}', r'{{پانویس\1|چپ‌چین=بله}}', text, re.S)
    text = re.sub(r'<small>\s*{{پانویس(.*?)}}\s*</small>', r'{{پانویس\1|اندازه=کوچک}}', text, re.S)
    text = re.sub(r'{{راست‌چین}}\s*{{پانویس(.*?)}}\s*{{پایان راست‌چین}}', r'{{پانویس\1}}', text, re.S)
    text = re.sub(r'{{چپ‌چین}}\s*{{پانویس(.*?)}}\s*{{پایان چپ‌چین}}', r'{{پانویس\1|چپ‌چین=بله}}', text, re.S)
    text = re.sub(r'<small>\s*{{پانویس(.*?)}}\s*</small>', r'{{پانویس\1|اندازه=کوچک}}', text, re.S)
    refsa=re.findall(r'(?ism)<ref[ >].*?</ref>',text, re.S)
    if refsa:
        if len(refsa) > 7:
            text = text.replace('{{پانویس}}','{{پانویس|۲}}')
            text = text.replace('{{پانویس|اندازه=کوچک}}','{{پانویس|۲|اندازه=کوچک}}')
            text = text.replace('{{پانویس|عرض=۳۰}}','{{پانویس|۲|عرض=۳۰}}')
            text = text.replace('{{پانویس|اندازه=ریز}}','{{پانویس|۲|اندازه=ریز}}')
            text = text.replace('{{پانویس|گروه=پانویس}}','{{پانویس|۲|گروه=پانویس}}')
            text = text.replace('{{پانویس|چپ‌چین=بله}}','{{پانویس|۲|چپ‌چین=بله}}')
    text = re.sub(r'==<', '==\n<', text)#واگردانی خطای کد

    # Files
    text = re.sub(r'\[\[ *[Ii]mage *: *', '[[پرونده:', text)
    text = re.sub(r'\[\[ *[Ff]ile *: *', '[[پرونده:', text)
    text = re.sub(r'(\[\[پرونده:.*?\|) *thumb *(?=\|.*?]])', r'\1بندانگشتی', text)
    text = re.sub(r'(\[\[پرونده:.*?\|) *left *(?=\|.*?]])', r'\1چپ', text)
    text = re.sub(r'(\[\[پرونده:.*?\|) *right *(?=\|.*?]])', r'\1راست', text)
    text = re.sub(r'(\[\[پرونده:.*?\|) *center *(?=\|.*?]])', r'\1وسط', text)
    text = re.sub(r'(\[\[پرونده:.*?\|) *link *= *(?=.*?]])', r'\1پیوند=', text)    
    #a: الگوافزایی
    if text.find('{{پانویس')==-1 and text.find('<references group')==-1:
        if text.find('= منابع =') !=-1:
          text = re.sub(r'(= منابع =+\n)', r'\1{{پانویس}}\n', text, re.S)
    #e: نام الگوها
    text = re.sub('{{(?:جا:|subst:|)(?:فم|نیم[‌ ]?فاصله|فاصلهٔ? مجازی)}}', '‌', text)
    text = re.sub('{{(?:جا:|subst:|)--}}', '–', text)
    text = re.sub('{{(?:جا:|subst:|)---}}', '—', text)
    text = re.sub('{{(?:DEFAULTSORT|[Dd]efaultsort|ترتیب|ترتیب[‌ ]پیش[‌ ]?فرض) *[|:] *(?=.*?}})', '{{ترتیب‌پیش‌فرض:', text)
    text=re.sub(r'{{(ترتیب‌پیش‌فرض|DEFAULTSORT):[-\w,\s\(\)]+}}\n?', r'', text)    
    text = re.sub(r'{{(?:[Cc]ommons?|انبار|ویکی انبار) ?\|', '{{ویکی‌انبار|', text)
    text = re.sub(r'{{(?:[Ww]ikispecies|ویکی گونه) ?\|', '{{ویکی‌گونه|', text)
    text = re.sub(r'{{(?:[Cc]ommons?[\- ]?(?:[Cc]ats?|[Cc]ategory)|(?:ویکی[‌ ]?|)انبار[\- ]?رده) ?\|', '{{ویکی‌انبار-رده|', text)
    text = re.sub('{{(?:منبع|ذکر منبع|درخواست یادکرد منا?بع|نیاز به منبع|بی[‌ ]منبع|منبع کم|[Uu]nreferenced)}}', '{{بدون منبع}}', text)
    text = re.sub('{{(?:تمیز ?[کك]اری|[Cc]lean ?up)}}', '{{تمیزکاری}}', text)
    #text = re.sub('{{(?:منا?بع بیشتر|منبع بهتر|بهبود منا?بع|به)}}', '{{بهبود منبع}}', text)
    text = re.sub('{{وی[کك]ی[‌ ]?(?:سازی)}}', '{{ویکی‌سازی}}', text)
    text = re.sub('{{(?=(?:'+langs+r')\|)', r'{{به ', text)
    #تمیزکاری سرخط
    for i in range(0,2):    
        text=text.replace('{{سخ}} ','{{سخ}}').replace('{{سخ}} ','{{سخ}}').replace(' {{سخ}}','{{سخ}}').replace(' {{سخ}}','{{سخ}}').replace('{{سخ}}\n==','\n==').replace('==\n{{سخ}}','==\n').replace('=={{سخ}}','==').replace('{{سخ}}==','==')
        text=text.replace(']]\n{{سخ}}',']]{{سخ}}').replace('{{سخ}}\n[[','{{سخ}}[[').replace('{{سخ}}\n\n==','\n\n==').replace('{{سخ}}\n\n\n==','\n\n==').replace('{{سخ}}\n==','\n==').replace('==\n\n{{سخ}}','==\n\n').replace('==\n\n\n{{سخ}}','==\n\n')
    text=text.replace('{{سخ}}\n*','\n*').replace('{{سخ}}\n\n*','\n*').replace('{{سخ}}\n#','\n#').replace('{{سخ}}\n\n#','\n#').replace('{{سخ}}\n|','\n|').replace('{{سخ}}\n\n|','\n|')
    text=text.replace('%7B%7Bسخ}}','{{سخ}}')#Correcting the bug

    #تمیزکاری ارجاع‌ها
    text=text.replace('\n<ref','<ref').replace('</ref>\n<ref','</ref><ref').replace('</ref>{{سخ}}<ref','</ref><ref')
    #e: کامنت‌های اضافی
    comment_list=['<small></small>','<sup></sup>','<sub></sub>','<code></code>','<pre></pre>','<math></math>','<nowiki></nowiki>',"'''متن پررنگ'''","''متن مورب''",'<!--توضیح-->','<!--- رده‌بندی --->','<!--- میان‌ویکی را وارد کنید مثل [[en:Article]] --->','<!--- [[ویکی‌پدیا:پانویس‌ها]] را بخوانید. در وسط مقاله از <ref>منبع</ref> به عنوان منبع استفاده کنید -->']
    for item in comment_list:
        text=text.replace(item,'').replace(item+'\n','').replace(item.replace('><','>\n<'),'').replace(item.replace('><','>\n\n<'),'')  
    text=text.replace('==<','==\n<').replace('>==','>\n==')
    #حذف رده انگلیسی    
    text = re.sub(r'\[\[([Cc]ategory|رده):[\w\s\–\-\|]+?\]\]\r?\n?', "",text).replace('[[رده:|]]','')     
   
    #ابهام‌ردایی
    for i in ['ابهام زدایی','ابهامزدایی','ابهامزدائی','ابهام‌زدائی','ابهام زدائی']:
        text=text.replace('{{'+i+'}}','{{ابهام‌زدایی}}').replace('{{'+i.replace('ی','ي')+'}}','{{ابهام‌زدایی}}')
    
    #الگوهای خرد
    #if text.find('-خرد}}')!=-1:
    #    text=subs (text)
    #الگوها و خطوط
    text = re.sub(r'(\n\{\{.*?\}\}\n)\n+(\{\{.*?\}\}\n)',r"\1\2",text)

    #تمیزکاری خطوط
    text=text.replace('\n\n{{-}}\n\n','\n{{-}}\n').replace(' [[پرونده:]] ','').replace('<!---->\n','').replace('<!---->','')
    text = re.sub('[\r\n]{3,}', "\n\n",text)
    text=text.replace("\n''''''\n","\n")
    
    if old_text!=text:
        if msg_short:
            msg='تمیز+'+msg    
        else:
            msg='تمیزکاری + '+msg
    return text.strip(),msg
def subs (text):
    subslinks = re.findall(r'\{\{.*?\-خرد\}\}',text, re.S)
    tem='\n'
    for i in subslinks: 
        text=text.replace(i,'')
        tem+=i+'\n'
    tem='\n\n'+tem.strip()+'\n'
    text=add_cat_top (text,tem)
    return text

def Citation_links(text,msg):
    return zz_ref_link_correction_core.main(text,msg)

def Citation (text,msg):
    done=False
    for a in ['{{citation','{{Citation']:
        if  a in text:
            subslinks=text.split(a)
            b=0
            for item in subslinks:
                b+=1
                if b==1 or a+' needed' in item :
                    continue
                item=item.split('}}')[0]
                item_old=item
                count=-1
                for i in '۰۱۲۳۴۵۶۷۸۹':
                    count+=1
                    item=item.replace(i,str(count))
                if item!=item_old:
                    text=text.replace(item_old,item)
                    done=True
    if done:
        msg='ارجاع+'+msg
    return text,msg

def persian_sort(categorylist):
    finallradeh,s_radeh=[],[]
    alphabets=' ۰۱۲۳۴۵۶۷۸۹آابپتثجچحخدذرزژسشصضعغفقکگلمنوهی‌'
    for radeh in categorylist:
            radeh=radeh.replace('[[رده:','').replace(']]','')
            coderadeh=radeh
            for i in range(0,len(alphabets)):    
                alphabet=alphabets[i]
                if i<10:
                    j='0'+str(i)
                else:
                    j=str(i)
                coderadeh=coderadeh.replace(alphabet,j)
            s_radeh.append(coderadeh+'0000000000000000000@@@@'+radeh)
    s_radeh=list(set(s_radeh))
    sortedradeh=sorted(s_radeh)
    for radeh in sortedradeh:
        radeh='[[رده:'+radeh.split('@@@@')[1]+']]'
        finallradeh.append(radeh)
    return finallradeh
    
def catsorting(text,page,msg_short,msg=msg):
        new_text=text
        RE=re.compile("(\[\[رده\:(?:.+?)\]\])")
        cats=RE.findall(text)
        if not cats:
            return text,msg
        for i in cats:
                new_text=new_text.replace(i,"")
        cats=persian_sort(cats)
        for name in cats:
            if re.search("\[\[(.+?)\|[ \*]\]\]",name) or "[[رده:"+page.title()==name.split("]]")[0].split("|")[0]:
                cats.remove(name)    
                cats.insert(0, name)
        if cats==RE.findall(text):   
            return text,msg
        for i in cats:
            new_text=new_text+"\n"+i
        ccToolkit = cosmetic_changes.CosmeticChangesToolkit(page.site, redirect=page.isRedirectPage(), namespace = page.namespace(), pageTitle=page.title())
        new_text = ccToolkit.change(new_text)
        if msg_short:
            msg='مرتب+'+msg    
        else:
            msg=' + مرتب‌سازی رده‌ها + '+msg    
        return new_text,msg

def add_cat_top (text,addtemplate):
                text=text.replace(addtemplate+'\n','')
                
                if text.find('\n<!-- رده‌ها -->\n')!=-1:
                    num=text.find('\n<!-- رده‌ها -->\n')
                    text=text[:num]+addtemplate+'\n'+text[num:]
                    return text
                    
                if text.find('رده:')!=-1:    
                    num=text.find('[[رده:')
                    text=text[:num]+addtemplate+'\n'+text[num:]
                else:
                    m = re.search(r'\[\[([a-z]{2,3}|[a-z]{2,3}\-[a-z\-]{2,}|simple):.*?\]\]', text)
                    if m:
                        if m.group(0)=='[[en:Article]]':    
                            try:
                                if string.count(text,'[[en:Article]] --->')==1:    
                                    text=text.split('[[en:Article]] --->')[0]+'[[en:Article]] --->\n'+addtemplate+text.split('[[en:Article]] --->')[1]
                                else:
                                    text+='\n'+addtemplate                                
                            except:
                                text+='\n'+addtemplate
                        else:
                            num=text.find(m.group(0))
                            text=text[:num]+addtemplate+'\n'+text[num:]
                    else:
                        text+='\n'+addtemplate
                return text
   
def tem_cleaner(text,page):
    old_text=text
    text=text.replace('\r','')
    templates=templatequery(page.title(),'fa')
    khord,tartib='\n','\n'
    if not templates:
        return old_text
    for i in templates:
        if '{{'+i.replace('الگو:','') in text:
            temp_braket='{{'+i.replace('الگو:','')+text.split('{{'+i.replace('الگو:',''))[1].split('}}')[0]+'}}'
            template_sub=templatequery(i,'fa')
            if template_sub:    
                if 'الگو:الگوی خرد' in template_sub:
                        khord+=temp_braket+'\n'
                        text=text.replace(temp_braket,'').replace('}}\n\n{{','}}\n{{')
                for b in ['الگو:DEFAULTSORT', 'الگو:ترتیب رده', 'الگو:تنظیم رده', 'الگو:Defaultsort', 'الگو:ترتیب پیش‌فرض']:
                    if b==i and '{{ترتیب‌پیش‌فرض' in text:
                           text=text.replace(temp_braket,'').replace('}}\n\n{{','}}\n{{')
                
    if '{{ترتیب‌پیش‌فرض' in text:
        tartib='{{ترتیب‌پیش‌فرض'+text.split('{{ترتیب‌پیش‌فرض')[1].split('}}')[0]+'}}'
        text=text.replace(tartib,'').replace('}}\n\n{{','}}\n{{')
    addtext=re.sub('[\r\n]{3,}','\n\n','\n'+khord+'\n\n'+tartib+'\n')
    if addtext.strip():
        text=add_cat_top (text, addtext)
        text = re.sub('[\r\n]{3,}', "\n\n",text)
        text=text.replace('}}\n\n{{','}}\n{{').replace('}}\n\n\n[[','}}\n\n[[')
        if khord.strip():
            text=text.replace('}}'+khord,'}}\n'+khord)
        if tartib.strip():
            text=text.replace('}}\n'+tartib,'}}\n\n'+tartib)
        return text
    else:
        return old_text

def UnicodeURL(text,msg=msg):
    old_text=text
    RE=re.compile(r'\/\/.*?(?=[\s\n\|\}\]]|$)')
    fa_Urls=RE.findall(text)
    if fa_Urls:
        for URL in fa_Urls:
            try:
                URL=URL.split('<')[0]
                new_URL=urllib.unquote(URL.encode('utf8')).decode('utf8').replace(' ','%20').replace('{','%7B').replace('|','%7C').replace('}','%7D')
                new_URL = re.sub('[\r\n\t]', "",new_URL)
                text=text.replace(URL,new_URL)
            except:
                continue
        text=re.sub(r'\[(https?\:)(?=\/\/(?:[\w\-]+)\.(wikipedia|wikimedia|wikidata|wiktionary|wikisource|wikinews|wikivoyage|wikiquote)\.org\/[^\s\]]*)', r'[',text)
        if old_text!=text:
            msg='نشانی+'+msg 
    return text,msg

def reverting (text,old_text):
    #واگردانی بابت رفع باگ کد زیباسازی پای‌ویکی‌پدیا
    text=text.replace('< /','</')
    # math
    Regexs=re.compile(r'\<math\>.*?\<\/math\>') 
    maths = Regexs.findall(text)
    old_maths = Regexs.findall(old_text)
    count=0
    for m in maths:
        text=text.replace(maths[count],old_maths[count])
        count+=1
    # source
    Regexs=re.compile(r'(?is)<'+r'source .*?<'+r'/source'+r'>') 
    sources = Regexs.findall(text)
    old_sources = Regexs.findall(old_text)
    count=0
    for source in sources:
        text=text.replace(sources[count],old_sources[count])
        count+=1
    return text
def finall_cleaning(txt):
    #---zwnj cleaning
    txt = re.sub('‌{2,}', '‌', txt)
    txt = re.sub('‌(?![ئاآأإژزرذدوؤةبپتثجچحخسشصضطظعغفقکگلمنهیيًٌٍَُِّْٰٓٔكﮑﮐﮏﮎﻜﻛﻚﻙىىىﻴﻳﻲﻱﻰىىﻯيکیہەھ]|[\u0900-\u097F]|ֹ)', '', txt) # در پس
    txt = re.sub('(?<![ئبپتثجچحخسشصضطظعغفقکگلمنهیيًٌٍَُِّْٰٓٔكﮑﮐﮏﮎﻜﻛﻚﻙىىىﻴﻳﻲﻱﻰىىﻯيکیہەھ]|[\u0900-\u097F]|f|ֹ)‌', '', txt) # در پیش
    return txt

def fa_cosmetic_changes(text,page,msg=msg,msg_short=True):
    old_text=text    
    old_msg=msg
    if page.namespace()==0 or testpass:#-------These functions are designed for namespace=0.
        text=text.replace('[[\u200c','[[اااااااا').replace(']]\u200c',']]بببببببببب')
        text=text.replace('\u200c[[','ججججججججججج[[').replace('\u200c]]','چچچچچچچچچچ]]')
        text=text.replace('ː',':') #replace nostandard : with standard one
        text,msg=cleaning(text,msg_short,msg)
        if text==minor_edits(old_text):#---------------Undoing minor changes
            text=old_text
            msg=old_msg      
        text_new=tem_cleaner(text,page)
        text_new,msg=catsorting(text_new,page,msg_short,msg)
        text_new,msg=dictation(text_new,msg_short,msg)
        text_new,msg=UnicodeURL(text_new,msg)
        text_new,msg=Citation(text_new,msg)
        text_new,msg=Citation_links(text_new,msg)
        if text_new!=text:
            text=minor_edits(text_new)   
        msg=msg.replace("+("," (").replace("+ ("," (").replace("++","+").replace("+ +","+")

        if msg.strip()=='('+cleaning_version +')':    
            msg=''
        else:
            msg='+'+msg
        text=text.replace('[[اااااااا','[[\u200c').replace(']]بببببببببب',']]\u200c')
        text=text.replace('ججججججججججج[[','\u200c[[').replace('چچچچچچچچچچ]]','\u200c]]')
        return text,cleaning_version,msg
   
def run(preloadingGen,msg):
    msg_o=msg
    for fapage in preloadingGen:
        
        #try:
            pywikibot.output('------fa_cosmetic_changes starting on '+fapage.title()+' .....------------')
            msg=msg_o
            try:
                text=fapage.get()
            except:
                pywikibot.output('Page '+fapage.title()+' had problem!')
                continue
            old_text=text
            text,cleaning_version,msg=fa_cosmetic_changes(text,fapage,msg=msg,msg_short=True)
            text=reverting(text,old_text)
            if old_text!=text and text!=minor_edits(old_text):            
                pywikibot.output('-------------------------------------------')
                msg='ربات:زیباسازی'+msg.strip()+' ('+cleaning_version +')'
                msg=msg.replace("+("," (").replace("+ ("," (").replace("++","+").replace("+ +","+").strip()
                fapage.put(text,msg)
                msg_short=''                
                msg=''
        #except:
        #    continue
def fa_replaceExcept(text, old, new, exceptions,marker='', site=None):
    if site is None:
        site = pywikibot.Site()
    exceptionRegexes = {
        'comment':      re.compile(r'(?s)<!--.*?-->'),
        'header':       re.compile(r'\r?\n=+.+=+ *\r?\n'),
        'pre':          re.compile(r'(?ism)<pre>.*?</pre>'),
        'source':       re.compile(r'(?is)<'+r'source .*?<'+r'/source'+r'>'),
        'category':       re.compile(r'\[\[رده\:.*?\]\]'),
        'ref':          re.compile(r'(?ism)<ref[ >].*?</ref>'),
        'URL':         re.compile(r'\[\.*?\]'),
        'startspace':   re.compile(r'(?m)^ (.*?)$'),
        'table':        re.compile(r'(?ims)^{\|.*?^\|}|<table>.*?</table>'),
        'hyperlink':    compileLinkR(),
        'gallery':      re.compile(r'(?is)<gallery.*?>.*?</gallery>'),
        'link':         re.compile(r'\[\[[^\]\|]*(\|[^\]]*)?\]\]'),
        'file':         re.compile(r'(\[\[پرونده\:[^\]\|]*(\|[^\]]*)?\]\])'),
        'interwiki':    re.compile(r'(?i)\[\[:?(%s)\s?:[^\]]*\]\][\s]*'
                                   % '|'.join(site.validLanguageLinks() +
                                              site.family.obsolete.keys())),
        'property':     re.compile(r'(?i)\{\{\s*#property:\s*p\d+\s*\}\}'),
        'invoke':       re.compile(r'(?i)\{\{\s*#invoke:.*?}\}'),
    }
    if isinstance(old, basestring):
        old = re.compile(old)

    dontTouchRegexes = []
    except_templates = False
    for exc in exceptions:
        if isinstance(exc, basestring):
            if exc in exceptionRegexes:
                dontTouchRegexes.append(exceptionRegexes[exc])
            elif exc == 'template':
                except_templates = True
            else:
                dontTouchRegexes.append(re.compile(r'(?is)<%s>.*?</%s>'
                                                   % (exc, exc)))
            if exc == 'source':
                dontTouchRegexes.append(re.compile(
                    r'(?is)<syntaxhighlight .*?</syntaxhighlight>'))
        else:
            dontTouchRegexes.append(exc)
    if except_templates:
        marker1 = findmarker(text)
        marker2 = findmarker(text, '##', '#')
        Rvalue = re.compile('{{{.+?}}}')
        Rmarker1 = re.compile('%(mark)s(\d+)%(mark)s' % {'mark': marker1})
        Rmarker2 = re.compile('%(mark)s(\d+)%(mark)s' % {'mark': marker2})
        dontTouchRegexes.append(Rmarker1)
        origin = text
        values = {}
        count = 0
        for m in Rvalue.finditer(text):
            count += 1
            while '}}}%d{{{' % count in origin:
                count += 1
            item = m.group()
            text = text.replace(item, '%s%d%s' % (marker2, count, marker2))
            values[count] = item
        inside = {}
        seen = set()
        count = 0
        while TEMP_REGEX.search(text) is not None:
            for m in TEMP_REGEX.finditer(text):
                item = m.group()
                if item in seen:
                    continue
                seen.add(item)
                count += 1
                while '}}%d{{' % count in origin:
                    count += 1
                text = text.replace(item, '%s%d%s' % (marker1, count, marker1))
                for m2 in Rmarker1.finditer(item):
                    item = item.replace(m2.group(), inside[int(m2.group(1))])
                for m2 in Rmarker2.finditer(item):
                    item = item.replace(m2.group(), values[int(m2.group(1))])
                inside[count] = item
    index = 0
    markerpos = len(text)
    while True:
        match = old.search(text, index)
        if not match:
            break
        nextExceptionMatch = None
        for dontTouchR in dontTouchRegexes:
            excMatch = dontTouchR.search(text, index)
            if excMatch and (
                    nextExceptionMatch is None or
                    excMatch.start() < nextExceptionMatch.start()):
                nextExceptionMatch = excMatch

        if nextExceptionMatch is not None \
                and nextExceptionMatch.start() <= match.start():
            index = nextExceptionMatch.end()
        else:
            if callable(new):
                replacement = new(match)
            else:
                new = new.replace('\\n', '\n')
                replacement = new

                groupR = re.compile(r'\\(?P<number>\d+)|\\g<(?P<name>.+?)>')
                while True:
                    groupMatch = groupR.search(replacement)
                    if not groupMatch:
                        break
                    groupID = groupMatch.group('name') or \
                              int(groupMatch.group('number'))   
                    try:
                        replacement = replacement[:groupMatch.start()] + \
                                      match.group(groupID) + \
                                      replacement[groupMatch.end():]
                    except IndexError:
                        print ('\nInvalid group reference:', groupID)
                        print ('Groups found:\n', match.groups())
                        raise IndexError
            text = text[:match.start()] + replacement + text[match.end():]
            break
            index = match.start() + len(replacement)
            markerpos = match.start() + len(replacement)
        
    text = text[:markerpos] + marker + text[markerpos:]

    if except_templates: 
        for m2 in Rmarker1.finditer(text):
            text = text.replace(m2.group(), inside[int(m2.group(1))])
        for m2 in Rmarker2.finditer(text):
            text = text.replace(m2.group(), values[int(m2.group(1))])
    return text

def compileLinkR(withoutBracketed=False, onlyBracketed=False):
    """Return a regex that matches external links."""
    notAtEnd = '\]\s\.:;,<>"\|\)'
    notAtEndb = '\]\s\.:;,<>"\|'
    notInside = '\]\s<>"'
    regex = r'(?P<url>http[s]?://[^%(notInside)s]*?[^%(notAtEnd)s]' \
            r'(?=[%(notAtEnd)s]*\'\')|http[s]?://[^%(notInside)s]*' \
            r'[^%(notAtEnd)s])' % {'notInside': notInside, 'notAtEnd': notAtEnd}
    regexb = r'(?P<urlb>http[s]?://[^%(notInside)s]*?[^%(notAtEnd)s]' \
            r'(?=[%(notAtEnd)s]*\'\')|http[s]?://[^%(notInside)s]*' \
            r'[^%(notAtEnd)s])' % {'notInside': notInside, 'notAtEnd': notAtEndb}
    if withoutBracketed:
        regex = r'(?<!\[)' + regex
    elif onlyBracketed:
        regex = r'\[' + regexb
    else:
        regex=r'(?:(?<!\[)'+ regex+r'|\['+regexb+')'
    linkR = re.compile(regex)
    return linkR

def templatequery(enlink,firstsite):
    if _cache.get(tuple([enlink, firstsite, 'templatequery'])):
        return _cache[tuple([enlink, firstsite, 'templatequery'])]
    temps=[]
    try:
        enlink=unicode(str(enlink),'UTF-8').replace('[[','').replace(']]','').replace('en:','').replace('fa:','')
    except:
        enlink=enlink.replace('[[','').replace(']]','').replace('en:','').replace('fa:','')
    enlink=enlink.split('#')[0].strip()
    if enlink=='':
        _cache[tuple([enlink, firstsite, 'templatequery'])] = False
        return False    
    enlink=enlink.replace(' ','_')
    site = pywikibot.Site(firstsite)
    try:
        categoryname = pywikibot.data.api.Request(site=site, action="query", prop="templates",titles=enlink,redirects=1,tllimit=500)
        categoryname=categoryname.submit()
        for item in categoryname['query']['pages']:
            templateha=categoryname['query']['pages'][item]['templates']
            break
        for temp in templateha:
            temps.append(temp['title'].replace('_',' '))  
        _cache[tuple([enlink, firstsite, 'templatequery'])] = temps
        return temps
    except:
        _cache[tuple([enlink, firstsite, 'templatequery'])] = False
        return False

def main():
    summary_commandline,gen = None,None
    exceptions,PageTitles,namespaces = [],[],[]
    autoText,autoTitle = False,False
    genFactory = pagegenerators.GeneratorFactory()
    for arg in pywikibot.handleArgs():
            if arg == '-autotitle':
                autoTitle = True
            elif arg == '-autotext':
                autoText = True
            elif arg.startswith( '-page:' ):
                if len(arg) == 6:
                    PageTitles.append(pywikibot.input( 'Which page do you want to chage?' ))
                else:
                    PageTitles.append(arg[6:])
            elif arg.startswith( '-cat:' ):
                if len(arg) == 5:
                    PageTitles.append(pywikibot.input( 'Which Category do you want to chage?' ))
                else:
                    PageTitles.append('Category:'+arg[5:])
            elif arg.startswith('-except:'):
                exceptions.append(arg[8:])
            elif arg.startswith( '-namespace:' ):
                namespaces.append( int( arg[11:] ) )
            elif arg.startswith( '-ns:' ):
                namespaces.append( int( arg[4:] ) )
            else:
                generator = genFactory.handleArg(arg)
    #if generator:
    gen = genFactory.getCombinedGenerator(gen)
    if PageTitles:
        pages = [pywikibot.Page(faSite,PageTitle) for PageTitle in PageTitles]
        gen = iter( pages )
    if not gen:
        pywikibot.stopme()
    if namespaces != []:    
        gen = pagegenerators.NamespaceFilterPageGenerator( gen,namespaces )
    preloadingGen = pagegenerators.PreloadingGenerator( gen,pageNumber = 60 )#---number of pages that you want load at same time
    run(preloadingGen,msg)
 
if __name__ == "__main__":
    testpass=True
    msg=' '    
    main()
